[
  {
    "id": 1,
    "title": "Rinding Cities, association sportive",
    "imgProject": "riding-cities",
    "description": "Dans le cadre de ce projet, j'ai été chargé de l'actualisation du site Internet de l'association Riding Cities. La mission consistait à ajouter une nouvelle section et à modifier une section existante. Le développement s'est fait exclusivement en HTML, en réutilisant et en adaptant le code existant pour répondre aux exigences de la maquette.",
    "techUsed": ["HTML", "CSS"],
    "github": "https://github.com/JulienneH/RidingCities.git",
    "githubPages": "https://julienneh.github.io/RidingCities/"
  },
  {
    "id": 2,
    "title": "Bookie, agence de voyage",
    "imgProject": "Bookie",
    "description": "Le projet consistait à concevoir et intégrer la page d'accueil d'une agence de voyage en utilisant HTML et CSS, avec un accent particulier sur le design responsive. À partir des maquettes Figma fournies pour mobile, tablette et desktop, j'ai créé des composants d'interface qui respectent les exigences de design et assurent une expérience utilisateur optimale sur tous les appareils. Ce travail m'a permis d'affiner mes compétences en design responsive et de mieux comprendre comment structurer et styliser le code pour répondre aux attentes du client.",
    "techUsed": ["HTML", "CSS"],
    "github": "https://github.com/JulienneH/Bookie.git",
    "githubPages": "https://julienneh.github.io/Bookie/"
  },
  {
    "id": 3,
    "title": "OhMyFood, restauration",
    "imgProject": "ohmyfood",
    "description": "L’objectif de ce projet était de développer l'interface mobile-first du site web d’une start-up, en mettant l'accent sur la réactivité et l'ergonomie sur tous les appareils. En utilisant Sass pour la gestion des styles et en intégrant des animations CSS, j’ai créé une interface fluide et interactive à partir des maquettes Figma disponibles pour les versions mobile et desktop. L’approche mobile-first a permis de garantir que le site soit parfaitement optimisé pour les écrans mobiles avant de l’adapter aux autres résolutions.",
    "techUsed": ["HTML", "CSS", "SASS", "GIT", "GITHUB"],
    "github": "https://github.com/JulienneH/Projet-4",
    "githubPages": "https://julienneh.github.io/Projet-4/"
  },
  {
    "id": 4,
    "title": "Print-It, imprimerie",
    "imgProject": "printit",
    "description": "Ce projet m'a permis de me familiariser avec JavaScript en dynamisant un site web statique d'une imprimerie. L'objectif principal était d'intégrer un carrousel interactif afin de rendre le site plus engageant et dynamique. En travaillant sur ce projet, j'ai exploré les bases de JavaScript, un langage essentiel pour le développement web interactif, et appris à intégrer des éléments interactifs. J'ai mis à jour le code HTML existant et ajouté un carrousel en JavaScript, ce qui m’a permis de comprendre l'interaction entre JavaScript, HTML et CSS pour créer des fonctionnalités dynamique",
    "techUsed": ["HTML", "CSS", "JS", "GIT", "GITHUB"],
    "github": "https://github.com/JulienneH/Print-it-p5.git",
    "githubPages": "https://julienneh.github.io/Print-it-p5/"
  },
  {
    "id": 5,
    "title": "Portfolio d'une architecte",
    "imgProject": "portfolio-sophie-bluel",
    "description": "L'objectif de ce projet était de créer une page web dynamique pour le site d'une architecte d'intérieur, en utilisant JavaScript et en interagissant avec une API. J'ai travaillé sur le développement Front-End du site en créant une page de présentation des travaux de l'architecte. Cela a impliqué la gestion des événements utilisateurs et la manipulation des éléments du DOM avec JavaScript.",
    "techUsed": ["HTML", "CSS", "JS", "SWAGGER", "GIT", "GITHUB"],
    "github": "https://github.com/JulienneH/Portfolio-architecte-p6.git",
    "githubPages": ""
  },
  {
    "id": 6,
    "title": "Gestion de projet",
    "imgProject": "kanban",
    "description": "L'objectif de ce projet était de participer à la planification stratégique du développement d'un site web, en me concentrant sur l'organisation et la gestion du projet, sans intervenir dans la partie codage. Dans ce cadre, j'ai travaillé à partir de la maquette, des spécifications fonctionnelles et des User Stories pour comprendre les besoins du projet et organiser les différentes étapes de développement. J'ai rédigé les spécifications techniques en décomposant les fonctionnalités en tâches précises et en définissant les besoins fonctionnels. Pour assurer une gestion efficace du projet, j'ai utilisé Notion, où j'ai créé un tableau Kanban pour suivre les progrès et les priorités. En m’appuyant sur la méthode AGILE, j’ai planifié des sprints (cycles de travail de 15 jours) et organisé des réunions régulières comme les daily stand-ups pour favoriser la communication et l’adaptabilité dans un contexte professionnel.",
    "techUsed": ["NOTION"]
  },
  {
    "id": 7,
    "title": "Kasa, location immobilière",
    "imgProject": "kasa",
    "description": "Ce travail avait pour objectif de développer le front-end d'une application web en utilisant React et React Router, afin de créer une expérience utilisateur moderne et réactive. J'ai conçu et implémenté la logique de présentation des données et les composants React pour assurer une interface dynamique et fluide. React Router a été utilisé pour gérer la navigation entre les différentes pages de l'application, ce qui m'a permis d'acquérir une bonne maîtrise du routage dans une application web moderne.",
    "techUsed": ["HTML", "CSS", "REACT", "NODEJS", "GIT", "GITHUB"],
    "github": "https://github.com/JulienneH/Projet-8-React.git",
    "githubPages": "https://julienneh.github.io/Projet-8-React/#/home"
  },
  {
    "id": 8,
    "title": "Portfolio de photographe ",
    "imgProject": "optimisation ",
    "description": "Le but de ce travail était d'optimiser le référencement, la performance et l'accessibilité d'un site web afin d'améliorer son classement sur les moteurs de recherche et offrir une meilleure expérience utilisateur. J'ai commencé par identifier les problèmes de chargement et de référencement du site en utilisant des outils d'audit tels que Lighthouse et Wave. Sur la base des résultats obtenus, j'ai proposé des recommandations pour améliorer la vitesse de chargement, la structure du code, et l'optimisation pour les moteurs de recherche.",
    "techUsed": ["WAVE", "LIGHTHOUSE", "HTML", "CSS", "JS", "GIT", "GITHUB"],
    "github": "https://github.com/JulienneH/Optimisation-seo-p9.git",
    "githubPages": "https://julienneh.github.io/Optimisation-seo-p9/"
  },
  {
    "id": 9,
    "title": "724 events, agence événementielle ",
    "imgProject": "events",
    "description": "Ce projet m'a permis de finaliser le développement d'un site One-Page en me concentrant sur le débogage et la résolution des bugs.  Une partie importante du projet consistait à effectuer des tests unitaires, garantissant la fiabilité des différentes fonctionnalités du site. En parallèle, j'ai complété le cahier de recette, un document détaillant les scénarios de test nécessaires pour assurer le bon fonctionnement du site, incluant des tests unitaires et fonctionnels. Pour gérer le projet, j'ai utilisé Yarn comme gestionnaire de packages et Node.js pour exécuter du code JavaScript côté serveur.",
    "techUsed": ["REACT", "NODEJS", "YARN", "GIT", "GITHUB"],
    "github": "https://github.com/JulienneH/Projet10.git",
    "githubPages": "https://julienneh.github.io/Projet10/"
  },
  {
    "id": 10,
    "title": "Argent-Bank, banque en ligne",
    "imgProject": "argentbank",
    "description": "Dans ce projet, ma mission principale a été de développer le front-end d’une application bancaire en utilisant React et Redux, afin de créer une expérience utilisateur réactive et dynamique. J'ai commencé par intégrer le front-end avec le back-end en écrivant des appels API REST, avançant ainsi le travail du développeur back-end en testant et exploitant les endpoints fournis. L’interface utilisateur a été développée avec React, en mettant l’accent sur la création d'un tableau de bord complet et responsive pour les utilisateurs.Redux a été utilisé pour gérer les données de l’application et maintenir un état global cohérent à travers toute l'interface. Ce projet m’a permis de travailler dans un contexte professionnel collaboratif, en optimisant la communication entre les équipes front-end et back-end.",
    "techUsed": ["HTML", "CSS", "REACT", "REDUX", "SWAGGER", "GIT", "GITHUB"],
    "github": "https://github.com/JulienneH/Argent-Bank-ReactApp.git",
    "githubPages": ""
  }
]
